[SearchAndDestroy_var01 X2MissionNarrativeTemplate]
+ObjectiveTextPools[0]="找到变种人MEC原型"
+ObjectiveTextPools[1]="摧毁这个MEC"
+ObjectiveTextPools[2]="消灭所有目标敌人"
+ObjectiveTextPools[3]="撤出所有XCOM特工"

[SearchAndDestroy_var01 X2MissionTemplate]
+DisplayName="找到并摧毁：变种人原型"
+Briefing="摧毁变种人原型"
+PostMissionType="找到并摧毁：变种人原型"
+BriefingImage="img:///UILibrary_Common.Xcom_default"
+ObjectiveTextPools[0]="找到并消灭变种人原型"
+ObjectiveTextPools[1]="别让变种人原型逃走"
+PreMissionNarratives[0]="XPACK_NarrativeMoments.X2_XP_CEN_T_Eliminate_Field_Command_Dropship_Intro_A"
+PreMissionNarratives[1]="XPACK_NarrativeMoments.X2_XP_CEN_T_Eliminate_Field_Command_Dropship_Intro_B"
+PreMissionNarratives[2]="XPACK_NarrativeMoments.X2_XP_CEN_T_Eliminate_Field_Command_Dropship_Intro_C"

[GOp_SearchAndDestroy_var01 X2MissionFlavorTextTemplate]
FlavorText="缺少背景叙述"
CouncilSpokesmanSuccessText="干得漂亮，指挥官。成功消灭<XGParam:StrValue0/!WorldRegionName/>的变种人原型对敌人来说无疑是一个挫折。"
CouncilSpokesmanFailureText="不幸的是<XGParam:StrValue0/!WorldRegionName/>内那个变种人原型逃脱我们刺杀的消息已经传了出去。我们不能再浪费那样的好机会了。"  

[AdvMEC_ProtoM1 X2CharacterTemplate]
strCharacterName="MEC原型"
strAcquiredText="变种人MEC能造成大量伤害。" 
[AdvSupportMEC_ProtoM1 X2CharacterTemplate]
strCharacterName="防暴MEC原型"
strAcquiredText="变种人MEC能造成大量伤害。" 

[AdvMEC_ProtoM2 X2CharacterTemplate]
strCharacterName="重型MEC原型"
strAcquiredText="变种人MEC能造成大量伤害。" 
[AdvSupportMEC_ProtoM2 X2CharacterTemplate]
strCharacterName="重型防暴MEC原型"
strAcquiredText="变种人MEC能造成大量伤害。" 

[AdvMEC_ProtoM3 X2CharacterTemplate]
strCharacterName="超级重型MEC原型"
strAcquiredText="变种人MEC能造成大量伤害。" 
[AdvSupportMEC_ProtoM3 X2CharacterTemplate]
strCharacterName="超级重型防暴MEC原型"
strAcquiredText="变种人MEC能造成大量伤害。" 
